src/Documents/ПоступленияОтПоставщика/ПоступленияОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступленияОтПоставщика</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/СтатусыДоставкиСвернуто/СтатусыДоставкиСвернуто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыДоставкиСвернуто</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоГС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаВТК</name>
    <type>
      <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОтправкиГруза</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/СтатусыОтправкиГруза/СтатусыОтправкиГруза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОтправкиГруза</name>
  <enumValues>
    <name>НаСкладе</name>
  </enumValues>
  <enumValues>
    <name>СформирванаЗаявкаВТК</name>
  </enumValues>
  <enumValues>
    <name>ВыехалСТочки</name>
  </enumValues>
  <enumValues>
    <name>ВТранспортнойКомпании</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Утрачен</name>
  </enumValues>
  <enumValues>
    <name>ДобавленСчетЭК</name>
  </enumValues>
  <enumValues>
    <name>ОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПолучения</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ЗаявкаВТранспортнуюКомпанию/ЗаявкаВТранспортнуюКомпанию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаВТранспортнуюКомпанию</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаявки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Коробки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПоступленияОтПоставщика/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ДвиженияСтатусыДоставкиСвернуто(Отказ, РежимПроведения);

	
	
	
КонецПроцедуры

Процедура ДвиженияСтатусыДоставкиСвернуто(Отказ, Режим)
	Движения.СтатусыДоставкиСвернуто.Записывать = Истина;
	Движение = Движения.СтатусыДоставкиСвернуто.Добавить();
	Движение.Период = Дата;
	Движение.Статус = Перечисления.СтатусыОтправкиГруза.ОтПоставщика;
	Движение.ЗаявкаВТК=Документы.ЗаявкаВТранспортнуюКомпанию.ПустаяСсылка();
	Движение.Количество=Количество;
	Движение.КоличествоГС=0;
	Движение.КоличествоМест=КоличествоМест;
КонецПроцедуры
